---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.ResetOverride
source: html/accf7307-7f8f-3876-a478-09ffc96fd7ae.htm
---
# Autodesk.Revit.DB.ScheduleField.ResetOverride Method

Resets the override of this field.

## Syntax (C#)
```csharp
public void ResetOverride()
```